'''


1. Сколько всего символов в тексте
2. Сколько букв в тексте (без пробелов и знаков препинания (,.!?))
3. Сколько всего строк в тексте
4. Сколько непустых строк в тексте
5. Сколько всего слов в тексте
6*. Сколько слов в каждой строке
7*. Сколько символов в каждой строке
8. Найти повторяющиеся слова в тексте с указанием количества
9*. Провести частотный анализ букв (частота появления какждой буквы в тексте)
10. Найти все посторонние символы (пробелы и знаки препинания) - какие и сколько

Пример вывода:
1. Всего символов в тексте - 670
2. Букв в тексте - 500
3. Всего строк в тексте - 40
4. Непустых строк в тексте - 30
5. Всего слов в тексте - 100
6. Анализ слов по строкам:
1 строка - 5 слов
2 строка - 4 слова
3 строка - 6 слов
....
7. Анализ символов по строкам:
1 строка - 25 символов
2 строка - 16 символов
'''
from defer import return_value

a = """
Я помню чудное мгновенье:
Передо мной явилась ты,
Как мимолетное виденье,
Как гений чистой красоты.

В томленьях грусти безнадежной,
В тревогах шумной суеты,
Звучал мне долго голос нежный
И снились милые черты.

Шли годы. Бурь порыв мятежный
Рассеял прежние мечты,
И я забыл твой голос нежный,
Твои небесные черты.

В глуши, во мраке заточенья
Тянулись тихо дни мои
Без божества, без вдохновенья,
Без слез, без жизни, без любви.

Душе настало пробужденье:
И вот опять явилась ты,
Как мимолетное виденье,
Как гений чистой красоты.

И сердце бьется в упоенье,
И для него воскресли вновь
И божество, и вдохновенье,
И жизнь, и слезы, и любовь.
"""

print(f'Колво символов: {len(a)}')
b = a.replace(' ', '').replace(',', '').replace('.','').replace('\n','').replace(':','')
count = 0
for i in a:
    if i.isalpha():
        count+=1

print(f'Колво букв: {count}')
print(f'Колво букв: {len(b)}')
c = a.replace('\n', '%')
count_2 = 0
for i in c:
    if i == '%':
        count_2+=1


d = a.splitlines()

print(f'Колво строк: {count_2}')
print(f'Колво строк: {len(d)}')

count_3 = 0
index = 0
while index < len(d):
    line = d[index]
    if line != '':
        count_3+=1
    index+=1

print(f'Колво непустых строк: {count_3}')


words = a.split()
word_count = len(words)
print(f"Количество слов в стихотворении: {len(words)}")



d = a.splitlines()
index = 0
while index < len(d):
    line = d[index]

    words = line.split()
    print(f'строка {index} имеет {len(words)} слов')
    index += 1



d = a.splitlines()
index = 0
while index < len(d):
    line = d[index]
    count_5=0
    for i in line:
        if i.isalpha():
            count_5+=1
    print(f'строка {index} имеет {count_5} букв')
    index += 1





words = a.split()
i_see=[]
dublicates = []
for i in words:
    i = i.lower()
    if i in i_see and i not in dublicates:
        dublicates.append(i)
    i_see.append(i)
print(f'колво повторов слов {len(dublicates)}:{dublicates}')


d = a.splitlines()
prep = []
index = 0
while index < len(d):
    line = d[index]
    count_5=0
    for i in line:
        if not i.isalpha():
            prep.append(i)

    index += 1
print(f'лишние знаки - {len(prep)}: {prep}')