'''
Автомат получает на вход трёхзначное число. По этому числу строится новое число по следующим правилам.

1.Складываются первая и вторая, а также вторая и третья цифры исходного числа.

2.Полученные два числа записываются друг за другом в порядке возрастания (без разделителей).

Пример. Исходное число: 843. Суммы: 8+4=12; 4+3=7. Результат: 712.

Сколько существует чисел, в результате обработки которых автомат выдаст число 1216?
'''

result=[]
for i in range(100,1000):
    list_i = list(str(i))
    i_1 = int(list_i[0])+int(list_i[1])
    i_2 = int(list_i[1]) + int(list_i[2])
    if i_1>i_2:
        i_all = str(i_2)+str(i_1)

    else:
        i_all = str(i_1)+str(i_2)

    if int(i_all)==1216:
        result.append(i)
print(len(result))



