'''
Автомат обрабатывает натуральное числo N по следующему алгоритму:

1.Строится двоичная запись числаN.

2.Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается остаток от деления суммы на 2.

3.Предыдущий пункт повторяется для записи с добавленной цифрой.

4.Результат переводится в десятичную систему и выводится на экран.

Пример. Дано числоN=13. Алгоритм работает следующим образом:

1.Двоичная запись числаN: 1101.

2.Сумма цифр двоичной записb — 3, остаток от деления на 2 равен 1, новая запись: 11011.

3.Сумма цифр полученной записи— 4, остаток от деления на 2 равен 0, новая запись: 110110.

4.На экран выводится число54.


Какое наименьшее число, большее 93, может появиться на экране в результате работы автомата?
'''

for n in range(1,100):
    n = bin(n)[2:]
    n = list(n)

    summ = 0
    for i in n:
        summ += int(i)
    ost = int(summ)%2
    n.append(ost)
    n_2 = n
    summ_2 = 0
    for i in n_2:
        summ_2+= int(i)
    ost_2 = int(summ_2) % 2
    n_2.append(ost_2)
    n_3 = n_2
    n_3_count  = ''
    for i in n_3:
        n_3_count+=str(i)

    import os

print(os.name)


